openfoam_cases/deepflame_channel/0.orig/CO2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ydefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    // X0 
    // {
    //     type            inletOutlet;
    //     inletValue      uniform 0.00;
    //     value           uniform 0.00;
    // }

    XL
    {
        type            inletOutlet;
        inletValue      uniform 0.0;
        value           uniform 0.0;
    }

    "(border).*"
    {
        type            zeroGradient;
        // value           uniform 0.0;
    }

    "(sym).*"
    {
        type            symmetryPlane;
    }

}


// ************************************************************************* //
