openfoam_cases/deepflame_channel/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    // X0
    // {
    //     type            zeroGradient;
    // //     type            inletOutlet;
    // //     inletValue      $internalField;
    // //     value           $internalField;
    // }
    XL
    {
        // type            zeroGradient;
        type            advective;
        // type totalPressure;
        // p0              uniform 100000;
        // inletValue      $internalField;
        // value           $internalField;
    }
    "(border).*" {
        type zeroGradient;
        // p0  $internalField;
    }
    "(sym).*"
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
