openfoam_cases/deepflame_channel/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicRefineFvMesh;

// multiCritRefinementControls
// {
//     enableMultiCritRefinementControl  false;
// }

// dynamicRefineFvMeshCoeffs
// {
    // How often to refine
    refineInterval  2; 

    // Field to be refinement on
    field           normalisedGradrho;

    // Refine field in between lower..upper
 //   minLevel 0.01;
//    maxLevel 0.99;

    lowerRefineLevel 0.1;
    upperRefineLevel 1;

    // If value < unrefineLevel unrefine
    unrefineLevel   -0.1;

    // Have slower than 2:1 refinement
    nBufferLayers   2;

    // Refine cells only up to maxRefinement levels
    maxRefinement   1;

    // Stop refinement if maxCells reached
    maxCells        100000;

    // Flux field and corresponding velocity field. Fluxes on changed
    // faces get recalculated by interpolating the velocity. Use 'none'
    // on surfaceScalarFields that do not need to be reinterpolated.
    // correctFluxes
    // (
    //     //(phi none)
    //     //(nHatf none) 
    //     //(rhoPhi none)
    //     //(alphaPhi0.water none)
    //     //(ghf none)
    //     //(neg none)
    //     //(pos none)
    // );
     correctFluxes ((phi none));

    // Write the refinement level as a volScalarField
    dumpLevel       true;
// }


// ************************************************************************* //
